src/main/resources/atscale-micro/0042-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><Session xmlns="urn:schemas-microsoft-com:xml-analysis" SessionId="2EF2676D-4D63-455D-A136-93C08062CB01"/></soap:Header><soap:Body><Execute xmlns="urn:schemas-microsoft-com:xml-analysis"><Command><Statement>SELECT {([Measures].[Tax Amt],[Order Date].[MonthHierarchy].[All])} ON 0 FROM [AS Adventure Micro] CELL PROPERTIES VALUE, FORMAT_STRING, LANGUAGE, BACK_COLOR, FORE_COLOR, FONT_FLAGS</Statement></Command><Properties><PropertyList><Catalog>ASAdventureMicro</Catalog><Timeout>0</Timeout><Format>Native</Format><DbpropMsmdFlattened2>false</DbpropMsmdFlattened2><SafetyOptions>2</SafetyOptions><Dialect>MDX</Dialect><MdxMissingMemberMode>Error</MdxMissingMemberMode><DbpropMsmdOptimizeResponse>9</DbpropMsmdOptimizeResponse><DbpropMsmdActivityID>BF00EFBA-6825-45D4-AD5D-F26EB2C668E6</DbpropMsmdActivityID><DbpropMsmdRequestID>74531D0E-B633-4B87-BEED-5A19DEFE9BA3</DbpropMsmdRequestID><LocaleIdentifier>1033</LocaleIdentifier><DbpropMsmdMDXCompatibility>1</DbpropMsmdMDXCompatibility></PropertyList></Properties></Execute></soap:Body></soap:Envelope>